{
  "sobre.titulo": "Sobre o Projeto",
  "sobre.intro": "Este aplicativo CRM + Chatbot foi criado como <strong>material de estudo e portfólio</strong>, reunindo práticas atuais de <strong>Full Stack JavaScript</strong> (Node.js no backend e ES Modules no frontend) em um cenário realista. Os dados são fictícios e <strong>não devem ser usados em produção</strong> sem auditoria de segurança, revisão de infraestrutura, cobertura de testes automatizados e pipeline de deploy apropriado.",
  "sobre.resumo": "Resumo da Aplicação",
  "sobre.resumoTexto": "Um protótipo de CRM integrado a um chatbot para captar e nutrir leads: contempla cadastro/edição de clientes (modal e inline), atribuição automática de consultores por especialidade, filtros avançados com busca unificada, ordenação e paginação flexíveis, além de painéis analíticos que refletem métricas em tempo real. A interface entrega feedback moderno (toasts, confirmações customizadas, animações acessíveis) enquanto a arquitetura reforça organização modular entre Express, validações compartilhadas e manipulação direta de DOM sem recorrer a frameworks pesados.",
  "sobre.tecnologias": "Tecnologias & Métodos",
  "sobre.tecnologiasTexto": "Base tecnológica integra serviços enxutos em <strong>Node.js + Express</strong> com uma SPA modular sem frameworks pesados. Organização em camadas, validações compartilhadas e pipelines consistentes deixam o caminho aberto para evoluções rápidas e seguras.",
  "sobre.tecnologiasBackend": "Backend orientado a serviços",
  "sobre.tecnologiasBackendDesc": "API Express enxuta com camadas de modelo e validação compartilhadas com o frontend, pronta para crescer em integrações REST ou GraphQL.",
  "sobre.tecnologiasFrontend": "Frontend modular em ES Modules",
  "sobre.tecnologiasFrontendDesc": "SPA leve com ES Modules, eventos customizados e widgets plugáveis sem bibliotecas pesadas, preservando controle total do DOM.",
  "sobre.tecnologiasQualidade": "Qualidade e experiência",
  "sobre.tecnologiasQualidadeDesc": "Validações reutilizadas, estados acessíveis e microinterações com feedback imediato (toasts, confirmações, animações) para uma UX consistente em qualquer dispositivo.",
  "sobre.techPillNode": "<i class=\"fa-brands fa-node-js\" aria-hidden=\"true\"></i> Node.js 18+",
  "sobre.techPillExpress": "<i class=\"fa-solid fa-network-wired\" aria-hidden=\"true\"></i> Express 5",
  "sobre.techPillModules": "<i class=\"fa-solid fa-puzzle-piece\" aria-hidden=\"true\"></i> ES Modules",
  "sobre.techPillA11y": "<i class=\"fa-solid fa-universal-access\" aria-hidden=\"true\"></i> Acessibilidade",
  "sobre.techPillUX": "<i class=\"fa-solid fa-wand-magic-sparkles\" aria-hidden=\"true\"></i> UX Responsiva",
  "sobre.conheca": "Conheça-nos",
  "sobre.conhecaTexto": "Links para contato e acompanhamento de outros projetos:",
  "sobre.disclaimer": "Este repositório existe para fins educacionais e demonstração de competências. Qualquer semelhança com dados reais é coincidência.",
  "sobre.atualizado": "Atualizado em",
  "toast.leadPersistido": "Lead enviado (persistido)",
  "toast.leadFallback": "Lead enviado via fallback",
  "toast.leadErro": "Erro ao enviar lead",
  "toast.leadRecebido": "Novo cliente recebido do chatbot",
  "toast.leadInvalido": "Cliente recebido do chatbot com dados inválidos",
  "status.novo": "Novo",
  "status.em_andamento": "Em andamento",
  "status.contatado": "Contatado",
  "status.convertido": "Convertido",
  "status.perdido": "Perdido"
}